# Working with different file formats

## CSV file format

In [4]:
!pip install seaborn lxml openpyxl panda

Defaulting to user installation because normal site-packages is not writeable
Requirement already satisfied: seaborn in c:\users\anaconda3\lib\site-packages (0.13.2)
Requirement already satisfied: lxml in c:\users\anaconda3\lib\site-packages (5.2.1)
Requirement already satisfied: openpyxl in c:\users\anaconda3\lib\site-packages (3.1.5)
Collecting panda
  Using cached panda-0.3.1.tar.gz (5.8 kB)
  Preparing metadata (setup.py): started
  Preparing metadata (setup.py): finished with status 'done'
Requirement already satisfied: numpy!=1.24.0,>=1.20 in c:\users\anaconda3\lib\site-packages (from seaborn) (1.26.4)
Requirement already satisfied: pandas>=1.2 in c:\users\anaconda3\lib\site-packages (from seaborn) (2.2.2)
Requirement already satisfied: matplotlib!=3.6.1,>=3.4 in c:\users\anaconda3\lib\site-packages (from seaborn) (3.9.2)
Requirement already satisfied: et-xmlfile in c:\users\anaconda3\lib\site-packages (from openpyxl) (1.1.0)
Requirement already satisfied: setuptools in c:\users\anaconda3\lib\site-packages (from panda) (75.1.0)
Requirement already satisfied: requests in c:\users\anaconda3\lib\site-packages (from panda) (2.32.3)
Requirement already satisfied: contourpy>=1.0.1 in c:\users\anaconda3\lib\site-packages (from matplotlib!=3.6.1,>=3.4->seaborn) (1.2.0)
Requirement already satisfied: cycler>=0.10 in c:\users\anaconda3\lib\site-packages (from matplotlib!=3.6.1,>=3.4->seaborn) (0.11.0)
Requirement already satisfied: fonttools>=4.22.0 in c:\users\anaconda3\lib\site-packages (from matplotlib!=3.6.1,>=3.4->seaborn) (4.51.0)
Requirement already satisfied: kiwisolver>=1.3.1 in c:\users\anaconda3\lib\site-packages (from matplotlib!=3.6.1,>=3.4->seaborn) (1.4.4)
Requirement already satisfied: packaging>=20.0 in c:\users\anaconda3\lib\site-packages (from matplotlib!=3.6.1,>=3.4->seaborn) (24.1)
Requirement already satisfied: pillow>=8 in c:\users\anaconda3\lib\site-packages (from matplotlib!=3.6.1,>=3.4->seaborn) (10.4.0)
Requirement already satisfied: pyparsing>=2.3.1 in c:\users\anaconda3\lib\site-packages (from matplotlib!=3.6.1,>=3.4->seaborn) (3.1.2)
Requirement already satisfied: python-dateutil>=2.7 in c:\users\anaconda3\lib\site-packages (from matplotlib!=3.6.1,>=3.4->seaborn) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\anaconda3\lib\site-packages (from pandas>=1.2->seaborn) (2024.1)
Requirement already satisfied: tzdata>=2022.7 in c:\users\anaconda3\lib\site-packages (from pandas>=1.2->seaborn) (2023.3)
Requirement already satisfied: charset-normalizer<4,>=2 in c:\users\anaconda3\lib\site-packages (from requests->panda) (3.3.2)
Requirement already satisfied: idna<4,>=2.5 in c:\users\anaconda3\lib\site-packages (from requests->panda) (3.7)
Requirement already satisfied: urllib3<3,>=1.21.1 in c:\users\anaconda3\lib\site-packages (from requests->panda) (2.2.3)
Requirement already satisfied: certifi>=2017.4.17 in c:\users\anaconda3\lib\site-packages (from requests->panda) (2024.8.30)
Requirement already satisfied: six>=1.5 in c:\users\anaconda3\lib\site-packages (from python-dateutil>=2.7->matplotlib!=3.6.1,>=3.4->seaborn) (1.16.0)
Building wheels for collected packages: panda
  Building wheel for panda (setup.py): started
  Building wheel for panda (setup.py): finished with status 'done'
  Created wheel for panda: filename=panda-0.3.1-py3-none-any.whl size=7245 sha256=aaa17b98ca048fdc68f31a4b5a718cca70bb000a5fad3e0a2eb11272fc54254c
  Stored in directory: c:\users\you computer\appdata\local\pip\cache\wheels\98\41\5b\6ca54e0b6a35e1b7248c12f56fcb753dfb7717fefaa0fb45f5
Successfully built panda
Installing collected packages: panda
Successfully installed panda-0.3.1

In [10]:
import requests
import pandas as pd
url = "https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-PY0101EN-SkillsNetwork/labs/Module%205/data/addresses.csv"

In [29]:
def download(url, filename):
    response = requests.get(url)
    if response.status_code == 200:
        with open(filename, "wb") as f:
            f.write(response.content)
download(url, "addresses.csv")
df = pd.read_csv("addresses.csv", header=None)
df

,0,1,2,3,4,5
0,John,Doe,120 jefferson st.,Riverside,NJ,8075
1,Jack,McGinnis,220 hobo Av.,Phila,PA,9119
2,"John ""Da Man""",Repici,120 Jefferson St.,Riverside,NJ,8075
3,Stephen,Tyler,"7452 Terrace ""At the Plaza"" road",SomeTown,SD,91234
4,NaN,Blankman,NaN,SomeTown,SD,298
5,"Joan ""the bone"", Anne",Jet,"9th, at Terrace plc",Desert City,CO,123

In [30]:
# Add head column to the data frame
df.columns = ["First Name", "Last Name", "Location", "City", "State", "Area Code"]
df

,First Name,Last Name,Location,City,State,Area Code
0,John,Doe,120 jefferson st.,Riverside,NJ,8075
1,Jack,McGinnis,220 hobo Av.,Phila,PA,9119
2,"John ""Da Man""",Repici,120 Jefferson St.,Riverside,NJ,8075
3,Stephen,Tyler,"7452 Terrace ""At the Plaza"" road",SomeTown,SD,91234
4,NaN,Blankman,NaN,SomeTown,SD,298
5,"Joan ""the bone"", Anne",Jet,"9th, at Terrace plc",Desert City,CO,123

In [31]:
# select single column 
df["First Name"]

0                     John
1                     Jack
2            John "Da Man"
3                  Stephen
4                      NaN
5    Joan "the bone", Anne
Name: First Name, dtype: object

In [32]:
# select multiple colums
df = df[["First Name", "Last Name", "Location", "City", "State", "Area Code"]]
df

,First Name,Last Name,Location,City,State,Area Code
0,John,Doe,120 jefferson st.,Riverside,NJ,8075
1,Jack,McGinnis,220 hobo Av.,Phila,PA,9119
2,"John ""Da Man""",Repici,120 Jefferson St.,Riverside,NJ,8075
3,Stephen,Tyler,"7452 Terrace ""At the Plaza"" road",SomeTown,SD,91234
4,NaN,Blankman,NaN,SomeTown,SD,298
5,"Joan ""the bone"", Anne",Jet,"9th, at Terrace plc",Desert City,CO,123

In [42]:
# select rows using .iloc and .loc
print(df.iloc[0,3])

Riverside

In [47]:
df.iloc[[0,1,2],[0]]

      First Name
0           John
1           Jack
2  John "Da Man"

In [48]:
print(df.loc[[0,1,2], "First Name"])

0             John
1             Jack
2    John "Da Man"
Name: First Name, dtype: object

# Transform function in pasdas

In [49]:
import pandas as pd
import numpy as np

In [62]:
# create dataframe
df = pd.DataFrame(np.array([[1,2,3],[4,5,6],[7,8,9]]), columns= ["a", "b", "c"])
df

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

In [63]:
# applying the transform function , add 10 to each element
df = df.transform(func=lambda x : x + 10)
df

    a   b   c
0  11  12  13
1  14  15  16
2  17  18  19

In [69]:
# find square root by transform()
df_result = df.transform(func = ["sqrt"])
df_result

          a         b         c
       sqrt      sqrt      sqrt
0  3.316625  3.464102  3.605551
1  3.741657  3.872983  4.000000
2  4.123106  4.242641  4.358899

## JSON file format

In [71]:
# create JSON file
import json
person = {
    "first_name" : "Mark",
    "last_name" : "Uni",
    "age" : 27,
    "Adress" : {
        "streetAdress" : "21 2nd street",
        "cityi": "New york",
        "state" : "NY",
        "postcode": "10021-3100"
    }
}

serialization using dump() function

**Syntax: json.dump(dict, file_pointer)**

In [75]:
with open("person.json", "w") as f: # writing JSON object
    json.dump(person,f)

In [77]:
#Serializing JSON
json_object = json.dumps(person, indent=4)

# Writing to sample.json
with open("sample.json", "w") as outfile:
    outfile.write(json_object)

print(json_object)

{
    "first_name": "Mark",
    "last_name": "Uni",
    "age": 27,
    "Adress": {
        "streetAdress": "21 2nd street",
        "cityi": "New york",
        "state": "NY",
        "postcode": "10021-3100"
    }
}

#### Reading json file

In [78]:
#opent file
with open("sample.json", "r") as f: 
    # reading file
    json_object= json.load(f)

print(json_object)

{'first_name': 'Mark', 'last_name': 'Uni', 'age': 27, 'Adress': {'streetAdress': '21 2nd street', 'cityi': 'New york', 'state': 'NY', 'postcode': '10021-3100'}}

# XLSX file format

#### reading xlsx file